@echo off
chcp 65001
echo ====================================================================================================
echo 检查文件放置是否完整
echo.
echo 1. 音频数据放于raw文件夹下，方法与sovits相同
echo.
echo 2. 标注文件格式为.list，文件名称应与raw下文件夹名字相同（说话人名称）
echo.
echo =========================================================================================================
echo.
echo 我已仔细阅读，确定完成文件放置（y/n）
set /p agree=:

if "%agree%"=="y" (echo ================================= 开始配置参数 =================================) else (exit)

echo 输入说话人名称：
set /p sp=:

echo ================================= 开始处理 =================================
echo "注意：路径和音频文件名中不能有中文和特殊符号！"
echo ================================ 开始重采样 ================================
.\env\python.exe resample.py
echo ================================ 生成最终标注文件 ================================
.\env\python.exe preprocess_text.py --transcription-path filelists/%sp%.list
echo ================================ 自动划分训练集、验证集，以及自动生成配置文件 ================================
.\env\python.exe bert_gen.py

pause
